_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_10 (Conv3D)           (None, 12, 128, 128, 16)  448       
_________________________________________________________________
batch_normalization_v1_9 (Ba (None, 12, 128, 128, 16)  64        
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 12, 128, 128, 16)  0         
_________________________________________________________________
max_pooling3d_9 (MaxPooling3 (None, 6, 64, 64, 16)     0         
_________________________________________________________________
conv3d_11 (Conv3D)           (None, 6, 64, 64, 16)     6928      
_________________________________________________________________
batch_normalization_v1_10 (B (None, 6, 64, 64, 16)     64        
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 6, 64, 64, 16)     0         
_________________________________________________________________
max_pooling3d_10 (MaxPooling (None, 3, 32, 32, 16)     0         
_________________________________________________________________
conv3d_12 (Conv3D)           (None, 3, 32, 32, 16)     6928      
_________________________________________________________________
batch_normalization_v1_11 (B (None, 3, 32, 32, 16)     64        
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 3, 32, 32, 16)     0         
_________________________________________________________________
max_pooling3d_11 (MaxPooling (None, 3, 16, 16, 16)     0         
_________________________________________________________________
conv3d_13 (Conv3D)           (None, 3, 16, 16, 16)     6928      
_________________________________________________________________
batch_normalization_v1_12 (B (None, 3, 16, 16, 16)     64        
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 3, 16, 16, 16)     0         
_________________________________________________________________
max_pooling3d_12 (MaxPooling (None, 3, 8, 8, 16)       0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 3072)              0         
_________________________________________________________________
dense_12 (Dense)             (None, 512)               1573376   
_________________________________________________________________
dropout_9 (Dropout)          (None, 512)               0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_10 (Dropout)         (None, 256)               0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 64)                16448     
_________________________________________________________________
dropout_11 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 10)                650       
=================================================================
Total params: 1,743,290
Trainable params: 1,743,162
Non-trainable params: 128
_________________________________________________________________
